# Cable Type Set Cable Size Usable Method

Source: https://www.revitapidocs.com/2026/2a0a7f44-9dcf-584e-0270-e8fbbddee4d0.htm

---

| Cable Type Set Cable Size Usable Method |
| --- |

Marks the Cable Size can be used by this Cable Type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetCableSizeUsable(
	ElementId cableSizeId,
	bool usable
)
```

```
Public Sub SetCableSizeUsable (
	cableSizeId As ElementId,
	usable As Boolean
)
```

```
public:
void SetCableSizeUsable(
	ElementId^ cableSizeId,
	bool usable
)
```

```
member SetCableSizeUsable :
        cableSizeId : ElementId *
        usable : bool -> unit
```

#### Parameters

cableSizeId ElementId
:   The Cable Size id.

usable Boolean
:   The Cable Size can be used by this Cable Type or not.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The id is not a Cable Size id. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace